# 02 - Einführung Pandas DataFrame
Um die Pandas Bibliothek benutzen zu können müssen wir diese erst importieren. Dies machen wir indem wir die Bibliothek mit dem Namen **Pandas als Modul** importieren. <!-- Hinweis: Das Modul muss installiert sein -->

**Module** sind ein wichtiges Element in Python. In Modulen sind zahlreiche Funktionen gebündelt, so dass wir diese auf einfache Art und Weise benutzen können. Dafür müssen wir diese im ersten Schritt Importieren.

## Import der Pandas Bibliothek
Codezellen mit allen Imports verwendeter Bibliotheken sind stets die ersten Codezellen im Dokument. Füge immer alle import Statements für dein Notebook in der ersten Codezelle. Vor dieser Zelle sollte kein Code stehen.

Ein Import funktioniert immer nach dem selben Prinzip:

`` import pandas ``

oder aber als import mit Alias

`` import pandas as pd``

In [2]:
# Importieren der Pandas Bibliothek. Da wir die Bibliothek öfter benutzen und wir 
# pandas nicht immer ausschreiben wollen, geben wir der Bibliothek das Alias pd
import pandas as pd

## Einlesen einer CSV-Datei
Einlesen eines CSVs mit `pd.read_csv()`


Stellen wir uns vor, wir haben die folgende Ordnerstruktur gegeben:
```
C<br>
|-- User<br>
    |-- Documents<br>
        |-- my_jupyter.ipynb<br>
        |-- data.csv
```

Dann können wir die benötigete CSV-Dateie auf zwei Arten referenzieren:


* Mit einem **absoluten** Pfad: ``"C:/User/Documents/data.csv``
* Mit einem **relativen** Pfad: ``data.csv``


Mit ``../`` bewegen wir uns einen Ordner nach oben, dh. wir gehen aus dem Documents<br>
Ordern in den User Ordner. Mit ``../../`` landen wir dementsprechend auf dem Laufwerk C.

In [3]:
# anzeigen des ergebnisses ohne den Dataframe in einer Variable zu speichern
pd.read_csv('../src/beispiele/02_kunden.csv')

  first_name  last_name                           email  gender
0   Oliviero  Longforth           olongforth0@wikia.com    Male
1    Curtice   Hallgate             challgate1@gmpg.org    Male
2       Darb     Evreux          devreux2@hostgator.com    Male
3        Ely    Themann            ethemann3@hao123.com    Male
4     Kaylyn      Brady                   kbrady4@51.la  Female
5  Sebastien   Rosevear              srosevear5@who.int    Male
6     Janela  Lanchbury  jlanchbury6@barnesandnoble.com  Female
7    Nicolle    Inkster           ninkster7@youtube.com  Female

In [7]:
# speichern in einer variablen
df_kunden = pd.read_csv('../src/beispiele/02_kunden.csv')

In [8]:
# damit es sichtbar wird, geben lassen wir uns den wert der variable anzeigen
df_kunden = pd.read_csv('../src/beispiele/02_kunden.csv')
df_kunden

  first_name  last_name                           email  gender
0   Oliviero  Longforth           olongforth0@wikia.com    Male
1    Curtice   Hallgate             challgate1@gmpg.org    Male
2       Darb     Evreux          devreux2@hostgator.com    Male
3        Ely    Themann            ethemann3@hao123.com    Male
4     Kaylyn      Brady                   kbrady4@51.la  Female
5  Sebastien   Rosevear              srosevear5@who.int    Male
6     Janela  Lanchbury  jlanchbury6@barnesandnoble.com  Female
7    Nicolle    Inkster           ninkster7@youtube.com  Female

## Sich eine Übersicht verschaffen
Mit den Funktionen ``.head()``, ``.tail()`` und ``.sample()`` können wir uns exemplarisch Datensätze anzeigen lassen, ohne den gesamten DataFrame angezeigt zu bekommen.

Mit den Funktionen ``len()`` und ``.info()`` erhalten wir die Länge des DataFrames und bei ``.info()`` noch zusätzliche Informationen

In [45]:
# head gibt uns die ersten 5 Zeilen des Dataframes
df_kunden.head()

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
1    Curtice   Hallgate     challgate1@gmpg.org    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
3        Ely    Themann    ethemann3@hao123.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [46]:
# tail gibt uns die letzten 5 Zeilen des Dataframes
df_kunden.tail()

  first_name  last_name                           email  gender
3        Ely    Themann            ethemann3@hao123.com    Male
4     Kaylyn      Brady                   kbrady4@51.la  Female
5  Sebastien   Rosevear              srosevear5@who.int    Male
6     Janela  Lanchbury  jlanchbury6@barnesandnoble.com  Female
7    Nicolle    Inkster           ninkster7@youtube.com  Female

In [47]:
# sample gibt uns 3 beliebige Datensätze zurück. Diese werden 
# bei jeder Ausführung der Zelle zufällig ausgewählt
df_kunden.sample(3)

  first_name  last_name                   email gender
5  Sebastien   Rosevear      srosevear5@who.int   Male
0   Oliviero  Longforth   olongforth0@wikia.com   Male
2       Darb     Evreux  devreux2@hostgator.com   Male

In [48]:
# Länge des DataFrames erhalten wir mit len()
len(df_kunden)

8

In [49]:
df_kunden.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
first_name    8 non-null object
last_name     8 non-null object
email         8 non-null object
gender        8 non-null object
dtypes: object(4)
memory usage: 336.0+ bytes

# Spalten oder Zeilen betrachten
Möchten wir nur Spalten oder Zeilen betrachten müssen wir diese auswählen. Betrachten wir nur eine Spalte oder eine Zeile bekommen wir als Rückgabewert keinen DataFrame sondern eine sogenannte **Series**.

In [50]:
# Zur Orientierung lassen wir uns die ersten 5 Elemente des DataFrames ausgeben
df_kunden.head()

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
1    Curtice   Hallgate     challgate1@gmpg.org    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
3        Ely    Themann    ethemann3@hao123.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [51]:
# Spaltennamen erfahren
df_kunden.columns

Index(['first_name', 'last_name', 'email', 'gender'], dtype='object')

In [52]:
# Zeilennamen erfahren
df_kunden.index

RangeIndex(start=0, stop=8, step=1)

In [53]:
# Spalte 'first_name' auslesen
df_kunden['first_name']

0     Oliviero
1      Curtice
2         Darb
3          Ely
4       Kaylyn
5    Sebastien
6       Janela
7      Nicolle
Name: first_name, dtype: object

In [54]:
# Spalte 'last_name' auslesen
df_kunden['last_name']

0    Longforth
1     Hallgate
2       Evreux
3      Themann
4        Brady
5     Rosevear
6    Lanchbury
7      Inkster
Name: last_name, dtype: object

In [55]:
# Zeile auslesen funktioniert wie das auslesen einer Spalte
df_kunden.loc[4]

first_name           Kaylyn
last_name             Brady
email         kbrady4@51.la
gender               Female
Name: 4, dtype: object

# Mit Spalten arbeiten
Kommen in einer Spalte Werte öfter vor, wie in unserem Beispiel in der Spalte 'gender', dann können wir uns eine Zusammenfassung geben lassen, wie oft welcher Wert vorkommt. Dafür wählen wir die entsprechende Spalte aus und wenden auf diese die Funktion `.values_counts()`an

In [56]:
# Die Spalte Gender enthält Werte öfter
df_kunden['gender']

0      Male
1      Male
2      Male
3      Male
4    Female
5      Male
6    Female
7    Female
Name: gender, dtype: object

In [57]:
# Mit .value_counts() können wir uns eine Zusammenfassung geben lassen
df_kunden['gender'].value_counts()

Male      5
Female    3
Name: gender, dtype: int64

# Mehrer Spalten oder Zeilen über den Namen auswählen

In [58]:
df_kunden.head()

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
1    Curtice   Hallgate     challgate1@gmpg.org    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
3        Ely    Themann    ethemann3@hao123.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [59]:
# Wir wählen mehrer Spalten aus und erhalten als Ergebnis diesmal einen DataFrame
df_kunden[['first_name', 'gender']]

  first_name  gender
0   Oliviero    Male
1    Curtice    Male
2       Darb    Male
3        Ely    Male
4     Kaylyn  Female
5  Sebastien    Male
6     Janela  Female
7    Nicolle  Female

In [60]:
# Auch wenn wir mehrer Zeilen auswählen erhalten wir als Ergebnis einen DataFrame
df_kunden.loc[[0,2,4]]

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [61]:
# Wir können sogar beide Methoden kombinieren
df_kunden.loc[[0,2,4]]['gender']

0      Male
2      Male
4    Female
Name: gender, dtype: object

In [62]:
df_kunden.loc[[0,2,4]][['first_name', 'gender']]

  first_name  gender
0   Oliviero    Male
2       Darb    Male
4     Kaylyn  Female

In [63]:
# Natürlich können wir uns auch das Ergebnis einer Selektion in einer neuen Variable speichern
df_select = df_kunden.loc[[0,2,4]]
df_select

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [64]:
df_select = df_kunden.loc[[0,2,4]]
df_select[['first_name', 'gender']]

  first_name  gender
0   Oliviero    Male
2       Darb    Male
4     Kaylyn  Female

# Tipps und Tricks
### Erweiterter Zugriff auf Spalten und Zeilen (Für Fortgeschritten)
* Für Fortgeschritten Pandas User: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html